# CannotCreateDirectShapeOrTypeDocumentCorruption Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DirectShapeFailures..::..CannotCreateDirectShapeOrTypeDocumentCorruption Property
BuiltInFailures..::..DirectShapeFailures Class See Also
---
Cannot create a DirectShape or DirectShapeType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateDirectShapeOrTypeDocumentCorruption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateDirectShapeOrTypeDocumentCorruption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateDirectShapeOrTypeDocumentCorruption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DirectShapeFailures Class
Autodesk.Revit.DB Namespace